#include <stdio.h>
#include <locale.h>
int N, K, n, L, k;
int main()
{
	setlocale(LC_ALL, "RUS");
	printf("123\n");
	printf("\n1\n2\n3");
	printf("\n\n1\n\t2\n\t\t3");
	printf("\n%d\n\t%d\n\t\t%d\n\t\t\t%d", 1, 2, 3, 4);
	printf("\n%10.3f\n", 12.234657);
	printf("\n%10.5f\n", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Деление %d на %d равен %d, а остаток %d\n", 7, 5, 7 / 5, 7 % 5);
	printf("Умножение %d на %d равен %d\n", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n", 5., 2., 5. / 2);
	printf("%d разделить %d равно %d\n", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n", 5., 2., 5. / 2);
	N = 14;
	K = 05;
	printf("Сейчас %d часов %d минуты 00 секунд\n", N, K);
	printf("Идёт %d минута суток\n", N * 60 + K);
	printf("До полуночи осталось %d часов и %d минут\n", 24 - N, 60 - K);
	printf("С 8.00 прошло %d секунд\n", (((N - 8) * 3600) + K * 60));
	printf("Текущий Час = %d/%d суток и текущая минута = %d/%d часа\n", N, 24, K, 60);
	//вариант 16
	L = 733;
	n = 2;
	printf("Дано: \n\t%.3d \n\t%.3d\n", n, L);
	float k;
	k = n / L;
	printf("Ответ: \n\t%+3.3f", k);
}